---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.CurveElemArcStartAngle
source: html/f714872b-1c82-0426-0ac6-4954fe6f3fc9.htm
---
# Autodesk.Revit.DB.ParameterTypeId.CurveElemArcStartAngle Property

"Angle 1"

## Syntax (C#)
```csharp
public static ForgeTypeId CurveElemArcStartAngle { get; }
```